Revit 2027 API
ParameterTypeId.RoomPhaseId Property
 "Phase Id"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoomPhaseId { get; }
Public Shared ReadOnly Property RoomPhaseId As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoomPhaseId {
	ForgeTypeId^ get ();
}
static member RoomPhaseId : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace